public class Main {
    public static void main(String[] args) {

        /*
        Создайте класс Flower, пусть у него будут поля цвет и название.
        Создайте класс Event, с полями название и описание.

        Создайте HashMap<Event, Flower> заполните его событиями и цветами.
        Например, свадьба = роза красная.

        Проверьте есть ли в получившемся мапе какой-нибудь конкретный ключ.
        Проверьте есть ли в получившемся мапе какое-нибудь конкретное значение.



         */
    }
}