public class Main {
    public static void main(String[] args) {
        Wine saperavi = new Wine("Saperavi");
        new Wine("Saperavi");
        new Wine("Saperavi");
        Wine baronRotshield = new Wine("Baron Rotshield");
        System.out.println(saperavi);
        System.out.println(baronRotshield);


//        ### Задание 1 Подсчет количества созданных бутылок вина
//        Реализовать подсчет количества созданных бутылок вина с помощью статической переменной.
//        Создайте класс Wine с полями title и int numberOfBottles.
//        Подумайте как осуществить увеличение numberOfBottles при ка
    }
}