package controller;
import model.Orange;

public class Main {
    public static void main(String[] args) {
        Orange orange1 = new Orange();
        Orange orange2 = new Orange();
        System.out.println(orange1);
        System.out.println(orange2);
//       Release 0
//    Создайте класс апельсин Orange с приватным полем diameter.
//    Пропишите конструктор для апельсина.
//    Чтобы при помощи него можно было создавать апельсины с диаметром
//    от 7 до 15 см (int);
//    Для проверки создайте несколько апельсинов в main.
//    Убедитесь, что размеры апельсина колеблются в указанных значениях.
    }
}